app/views/statuses/show.html.erb

  <strong>First name:</strong>
  <%= @status.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]