app/views/users/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
                    <div class="col-sm-6">
                            <div> <h6> <%= User.find(status.user_id).first_name %> <%= User.find(status.user_id).last_name %> </h6> </div>