app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = $1  [["user_id", 1]]
---
  def index
    @statuses = @user.statuses.all

INSERT INTO "statuses" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", "blahblah"], ["created_at", "2019-11-07 20:20:20.902100"], ["updated_at", "2019-11-07 20:20:20.902100"]]
---
  def create
    @status = @user.statuses.build(status_params)

    respond_to do |format|
      if @status.save

UPDATE "statuses" SET "content" = $1, "updated_at" = $2 WHERE "statuses"."id" = $3  [["content", "not as litty"], ["updated_at", "2019-11-08 00:21:09.109336"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = $1  [["id", 1]]
---
  def destroy
    @status.destroy