app/controllers/users_controller.rb

  def index
    @users = User.where.not(id: @current_user.id)
---
SELECT "users".* FROM "users"

  def home
    # get array of all statuses
    @status_array = []
    @current_user.followings.each do |user|
      next if user.statuses.empty?

      user.statuses.each do |status|
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = $1  [["user_id", 8]]
SELECT 1 AS one FROM "statuses" WHERE "statuses"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    @user.password = user_params[:password_hash]
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    if @current_user.id != @user.id
      redirect_to users_path
    else
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]

  def follow
    @followership = Followership.new(follower_user: @current_user, followed_user: @user)
    @followership.save
---
INSERT INTO "followerships" ("follower_user_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_user_id", 10], ["followed_user_id", 10], ["created_at", "2019-11-13 07:06:55.453305"], ["updated_at", "2019-11-13 07:06:55.453305"]]

  def unfollow
    @followership = Followership.where(follower_user_id: @current_user.id, followed_user: @user.id)[0]
    @followership.destroy!
---
SELECT "followerships".* FROM "followerships" WHERE "followerships"."follower_user_id" = $1 AND "followerships"."followed_user_id" = $2  [["follower_user_id", 10], ["followed_user_id", 10]]
DELETE FROM "followerships" WHERE "followerships"."id" = $1  [["id", 5]]